Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/P07.tmx
Source language: en_us
Languages: zh_cn

source: Tone
zh_cn: 语气

source: I love it when my friends introduce me to new people, although I never let on.
zh_cn: 在我朋友把我介绍给初次见面的人时，我很喜欢，但我从不表露出来。

source: I love the proud and honorable expression they wear when they say "This is Sandy - she's deaf", as if I were evidence of their benevolence.
zh_cn: 我喜欢他们说“这是珊蒂——她耳聋”时脸上露出的自豪和光荣的表情，仿佛我是他们仁慈心的表证。

source: I also love the split-second shocked expression on the new people, the hasty smiles and their best imitations of what they think of as their "normal faces".
zh_cn: 我还喜欢初相识的人脸上那瞬间产生的震惊表情、匆忙堆起的微笑以及非常出色地装扮出他们自以为是的“正常表情”。

source: If they do the ritual well enough I turn my head ever so slightly and tuck my hair behind one of my ears, whichever one's closer to them.
zh_cn: 如果他们这一套仪式做得足够好，我就微微地转过头，拢起头发塞到其中一只耳朵后面，任意一只离他们近的耳朵。

source: They never fail to say something nice about my pink hearing aids, while my regular friends beam on.
zh_cn: 他们从不会忘记对我的粉色助听器说些赞美的话，此时我的老友们脸上都笑开了花。

source: I'm thinking of starting a hearing aid collection, actually.
zh_cn: 事实上，我考虑开始收藏助听器。

source: They'd make better accessories than earrings.
zh_cn: 它们会是比耳环更好的饰品。

source: I once saw a catalog for clip-on hearing aids and hearing aid covers, and the products were most definitely fashion statements in various shapes and hues.
zh_cn: 我曾看到过一个夹式助听器和助听器护套的产品目录，那些产品有各种各样的形状和颜色，具有极为鲜明的时尚效果。

source: It'd be like the exquisitely expensive handbag Esther's dad got her when we were in high school.
zh_cn: 它会像我们在高中时埃丝特的爸爸给她的那个精美昂贵的手袋。

source: The rest of us could only admire, but could not imitate, because our dads weren't rich enough to spoil us that way.
zh_cn: 我们其他人只能羡慕，不能模仿，因为我们的爸爸还没有富到可以用那种方式来宠我们的地步。

source: And now, only I can wear hearing aids. My friends can do nothing but gush.
zh_cn: 而现在，只有我能戴助听器，我的朋友们只有羡慕的份儿。

source: To be honest, I quite like my deafness.
zh_cn: 老实说，我挺喜欢我的耳聋的。

source: It wasn't easy the first few years after the car accident and the stupid exploding airbag, but now it's become something that makes me special among my friends.
zh_cn: 在车祸和那个破安全气囊爆炸后的头几年里并不轻松，但现在这成了让我在朋友们中间很特别的某种东西。

source: None of my close friends are hearing impaired, simply because I wasn't born deaf.
zh_cn: 我的好朋友中没有一个有听力损伤的，这只是因为我不是天生耳聋的。

source: By the time I lost my hearing, I'd already accumulated a fixed circle of people, and they mostly rushed to participate in the drama.
zh_cn: 到我失去听力的时候，我已经汇聚了一个固定圈子的人，而他们大都匆忙地参与到这一变故中来。

source: You know how when you talk about your friends, you refer to them as Drew the Bartender, Carol the Feminist, Greg the Guy Who Can Knot a Cherry Stem with His Tongue and so on?
zh_cn: 当你谈论你的朋友们时，你知道怎么说吗？你把他们叫做酒保德鲁、女权主义者卡罗尔、那个能用舌头给樱桃梗打结的家伙格雷格，等等。

source: I'm Sandy the Deaf Girl.
zh_cn: 我是聋女孩珊蒂。

source: I like it.
zh_cn: 我喜欢这个称呼。

source: I don't have any other particularly outstanding traits or skills.
zh_cn: 我没有任何其他独特的显著特点或技能。

source: Never did.
zh_cn: 从来没有。

source: It's more than just standing out, too.
zh_cn: 另外，这也不仅仅只是引人注目。

source: I'm sure a lot of important events in my life wouldn't have happened or worked out quite the same way if I weren't wearing pink hearing aids.
zh_cn: 我确信如果我不戴着粉色助听器我生命中很多重大事件就不会发生或者不以完全相同的方式完成。

source: For example, the thing with Colin.
zh_cn: 比如，与克林有关的事。

source: I first met Colin at an apartment party.
zh_cn: 我在一个公寓派对上第一次遇到克林。

source: When Carol the Feminist introduced us to each other, I tucked my hair behind both my ears and leaned closer, not because he did the ritual particularly well, but because he was a stud.
zh_cn: 当女权主义者卡罗尔给我们相互介绍时，我把头发塞到两个耳朵后面，而且凑得更近，不是因为他把那套仪式做得非常好，而是因为他是一个体格健壮的大帅哥。

source: You should have seen his recovery smile after the inevitable surprise.
zh_cn: 你真该看看在不可避免的惊讶之后他那恢复到正常的微笑。

source: We went in search of drinks after the handshakes, and somewhere between what was functioning as the wine bar and the couch, we lost Carol.
zh_cn: 握手后我们去找饮料，在用作酒吧的地方和沙发之间的某处，我们丢了卡罗尔。

source: "Do you usually read lips like this? Or do you sign too?" he asked after a while.
zh_cn: “你通常像这样读唇语？还是也用手语？”过了一会儿他问。

source: "I mostly just read lips because it was easier to pick up than signing, although that's not the only reason I was staring at your lips," I told him.
zh_cn: “我通常只是读唇语，因为它比手语更容易学会，尽管这不是我盯着你的嘴唇的唯一原因，”我告诉他。

source: He laughed.
zh_cn: 他大笑。

source: We talked more, and then the host upped the music volume and dimmed the lights for the "dance floor", and I had to lean in much, much closer to be able to continue reading his lips in the semi-darkness.
zh_cn: 我们接着聊，后来主人调高了音乐的音量并为“舞池”调暗了灯光，我不得不靠得更加、更加近以便能够在半黑暗中继续读他的唇语。

source: And read his lips I did.
zh_cn: 而我确实读了他的唇语。

source: We did the usual and exchanged numbers, and a week later Colin did the unthinkable and called.
zh_cn: 我们像平常一样交换了电话号码，一个星期后克林做了件意想不到的事，他打了电话。

source: We went out, satisfied ourselves that the other person still looked good in sober daylight, and read more lips.
zh_cn: 我们出去，很满意对方在清醒的白天里看起来仍然很不错，并且读了更多的唇语。

source: Within two months Colin and I were dating.
zh_cn: 不到两个月我和克林开始约会。

source: Colin was the first after the accident, and now that I think about it, I wonder if my dismal post-accident love life had anything to do with feelings of self-consciousness.
zh_cn: 克林是我车祸后的第一个男友，现在想起这事儿，我怀疑我那凄凉的车祸后的爱情生活是否与不自然的感情有些关系。

source: I don't know.
zh_cn: 我不知道。

source: I try not to think about the first few years when it was hard.
zh_cn: 我努力不去想开始的那几年，那时是很艰难的。

source: There were minor difficulties and awkwardness, of course.
zh_cn: 当然，有小小的困难和不便。

source: On our fourth date, Colin invited me back to his apartment to watch a Blockbuster movie.
zh_cn: 在我们第四次约会时，克林邀我回他的公寓去看一部热门电影。

source: Apparently it was his modus operandi, and I can't say I didn't see it coming, although I felt a little miffed when he didn't realize immediately what he was doing wrong.
zh_cn: 显然那是他的习惯做法，我不能说我没有想象过这事的出现，尽管我在他没有立即意识到他做错了什么时感到有点恼火。

source: We'd turned the lights off and the subtitles on for the movie, of course.
zh_cn: 理所当然的，我们关了灯，开了电影的字幕。

source: Halfway through I suddenly had a disorientating sensation - I thought Colin had melted into or had somehow become his couch, and that I was sitting on and being enveloped by Colin, floating isolated in darkness and unable to look away from the bright pulsating other-world five feet away.
zh_cn: 看到一半时我突然有一种迷惑的感觉——我想克林已经融入或者不知怎么地变成了他的沙发，而我坐在克林身上被他包裹着，在黑暗中孤立地漂浮着，不能把脸从五英尺远处那个明亮的跳动着的另一个世界上转过去。

source: It was strange.
zh_cn: 很奇怪。

source: And then Colin leaned in and started whispering sweet nothings into my hearing-impaired left ear.
zh_cn: 然后克林斜身靠过来，开始对我听力受损的左耳低声说一些情话。

source: All I got were spurts of warm breath against my ears.
zh_cn: 我所得到的是温热的呼吸喷到我的耳朵上。

source: I pushed him away.
zh_cn: 我把他推开。

source: I suppose I just got weirded out by the reminder that I was deaf, and that coupled with the darkness...the sensation of losing two senses was a little too much.
zh_cn: 我想让我想起我是个聋子就已经使我不舒服了，还要再加上黑暗......失去两种感官能力的感觉有点太过分了。

source: It was the first hiccup we'd had, and such a tiny one that we got over it instantaneously.
zh_cn: 这是我们之间的第一个小摩擦，渺小到我们顷刻间就忘怀了。

source: The rest of the night was spent researching how his lips could be fully utilized in ways I could understand, even in the dark.
zh_cn: 那晚余下的时间都用在研究如何充分利用他的嘴唇，使我能够即使在黑暗中也能理解。

source: So Colin learned.
zh_cn: 就这样克林了解了。

source: It was no different from figuring out each other's quirks over time, really.
zh_cn: 其实，这与随着时间的流逝弄明白彼此的怪癖没什么区别。

source: I sometimes thought it made the relationship fun and interesting for him, sort of like an added twist to a game that he had perfected long ago, so that the game was once again challenging.
zh_cn: 我有时想，对他来说这使得恋爱关系变得好玩有趣，有点像在他很久以前就玩熟练的一个游戏中加入一点变化，这样一来这个游戏又一次具有了挑战性。

source: He did play the dating game quite well, from what I found out.
zh_cn: 依我所见，他确实把这个约会游戏玩得很好。

source: Our first birthday was his twenty-third.
zh_cn: 我们的第一个生日是他的二十三岁生日。

source: I got him a pair of tickets to the Rammstein concert; I knew he loved that band.
zh_cn: 我给他两张战车乐队（Rammstein）的音乐会门票；我知道他喜欢那支乐队。

source: When I flashed the tickets, he started exclaiming and laughing, but then abruptly stopped.
zh_cn: 当我炫耀地拿出门票时，他开始时又喊又笑，但是然后又突然地停下了。

source: "Sandy, are you sure?
zh_cn: “姗蒂，你确定吗？

source: I mean, can you...enjoy the concert?"
zh_cn: 我意思是，你能......欣赏音乐会吗？”

source: I tucked my hair behind my left ear and smiled at him.
zh_cn: 我把头发塞到左耳后，对他微笑。

source: "First of all, who said I want to enjoy the concert?
zh_cn: “首先，谁说我想要欣赏音乐会？

source: I never did like those kinds of violent, head-exploding noise you call music..."
zh_cn: 我从来都不喜欢那种你称之为音乐的粗暴的、吵到脑袋爆炸的噪音......”

source: "Hah!"
zh_cn: “哈哈！”

source: "...Second of all, I can hear most everything above a really loud shout, remember?
zh_cn: “......其次，我能听到大多数非常高的喊叫声，还记得吗？

source: So we're fine for the concert."
zh_cn: 所以我们去听音乐会没有问题。”

source: His smile was beautiful.
zh_cn: 他的微笑很是灿烂。

source: I tucked my hair behind my other ear.
zh_cn: 我把头发塞到另一只耳朵后面。

source: It turned out to be quite a success, the Rammstein concert.
zh_cn: 结果相当成功，我是说战车音乐会。

source: I'd never seen him so shot full of enthusiasm, so propelled by energy before, nor did I ever see him like that again.
zh_cn: 我以前从未见过他这么充满激情、这么活力四射，我也没有再看到过他这样。

source: We weren't even close enough to see much of the band, since I wasn't exactly raking in the money for front row seats.
zh_cn: 我们甚至离得不够近，看不到大部分乐队，因为我根本没有攒够买前排座的钱。

source: Colin was just driven purely by the music.
zh_cn: 克林纯粹是被音乐驱动着。

source: I imagined his eardrums, the pair of them vibrating like mad, writhing in non-stop orgasms somewhere inside his ears, unseen by the naked eye.
zh_cn: 我想象着他的耳膜，那对耳膜在他耳朵中的某处如疯子般震动、在不断的极度兴奋中翻腾，那是裸眼看不见的。

source: I felt a little jealous then and there, actually, something I thought I'd stopped doing for good when I'd quit asking "why me?"
zh_cn: 当时我竟然感到有点嫉妒，我以为当我不再问“为什么是我？”时我就已经永远不会再这么做了。

source: I looked at Colin for most of the night, taking in his jumping up and down, his whoops, his huge grin, and his sweat glistening in the colored lights that traveled as if they were alive.
zh_cn: 那天晚上大部分时间里我都看着克林，看他跳上跳下、他的大喊大叫、他的咧嘴大笑，还有他的汗水在仿佛有生命般游走的彩色灯光下闪闪发亮。

source: I could hear the amplified electric guitar parts and the screams just fine, and I could feel the drum beats through the floor.
zh_cn: 我能听清放大的电吉他部分和尖叫声，我还能通过地板感觉到鼓点声。

source: But it wasn't the same.
zh_cn: 但这是不一样的。

source: A month and a half later, Colin presented a pair of tickets on my birthday, tucked into the band of his trousers and only discovered after his shirt came off.
zh_cn: 一个半月后，克林在我生日时送了两张票，塞在他的裤腰带里，只有在他脱下衬衫后才发现。

source: They were for a book signing and reading event featuring Emily Barnes, a writer I absolutely adored.
zh_cn: 这是艾米莉·巴恩斯（Emily Barnes）的图书签售和阅读活动的门票，一个我极为崇拜的作家。

source: "I'm sorry the thing is next weekend and not today, but I thought we could celebrate your birthday a second time just the same," he winked.
zh_cn: “我很抱歉这活动是在下周末，不是在今天，但我想我们还是可以再一次庆祝你的生日的，”他眨眨眼。

source: I was more than thrilled.
zh_cn: 我兴奋不已。

source: The week leading up to the event, I re-read all of her books and agonized over which one of the four I should bring to have her sign, since we were only allowed one signature each.
zh_cn: 在活动前的那一周里，我重读了她所有的书，并且苦恼我该带四本中的哪一本去让她签名，因为我们每个人只允许有一个签名。

source: Colin laughed at me and said I was acting like a teenybopper when I made him promise to get in line as well, so that I could have two signed books instead of just one.
zh_cn: 当我让他答应也去排队，这样我就能有两本签名书而不是仅仅一本了时，克林笑话我，还说我表现得像个少年颓废派。

source: On the day of the event, we arrived at the bookstore early.
zh_cn: 在活动当天，我们早早地就到了书店。

source: They had cleared a section of the store by pushing bookshelves back, so that the whole place looked denser than I remembered, like a jungle that had turned magical and overgrown itself overnight.
zh_cn: 他们把书架往后推，在书店里清理出了一块地方，使整个地方看起来比我记忆中更密集了，好像一片丛林变成了有魔法似的，一夜之间簇叶丛生。

source: I certainly felt the magic, looking at the temporary stage and the half-filled rows of chairs in worship before it.
zh_cn: 毫无疑问我也感觉到了那种魔法，看着那个临时的舞台和它面前朝拜着它的那一排排坐了一半的椅子。

source: Colin held me by my hand and led me to seats in the last row.
zh_cn: 克林拉着我的手，领着我到最后一排的座位。

source: When I protested, he smiled and pointed to the speakers mounted just behind us.
zh_cn: 当我反对时，他微笑着，指指就安装在我们身后的扬声器。

source: "But I can read her lips if we sit up front!"
zh_cn: “可是如果我们坐在前面我可以读她的唇语！”

source: "But that's not the point of readings, is it?"
zh_cn: “但那不是阅读的目的，对吧？”

source: "But-"
zh_cn: “但是——”

source: "Do you admire her words or her looks?
zh_cn: “你是欣赏她的文字还是她的容貌？

source: Would you rather hear her own interpretation of her text or see her face?"
zh_cn: 你是更愿意听到她对自己文章的解读还是看到她的脸？”

source: I sat down, clutching two of Emily Barnes' books, convinced of the evening, and also of Emily Barnes, of Colin, of us.
zh_cn: 我坐下了，手里紧紧地抓着艾米莉·巴恩斯的两本书，对这个傍晚深信不疑，也对艾米莉·巴恩斯、克林、还有我们深信不疑。

source: It would have been perfect.
zh_cn: 这本来会是很完美的。

source: Sometimes I still think about it.
zh_cn: 有时我仍然会想起这件事。

source: The store manager walked up the temporary stage promptly at 6 PM.
zh_cn: 下午6点书店经理准时走上临时舞台。

source: Her turquoise green heels were precarious, and I imagined the clicking that came with each step.
zh_cn: 她青绿色的鞋跟摇摇欲倒，我想象着伴随着每一步的喀哒声。

source: "Welcome, ladies and gentlemen," she said.
zh_cn: “欢迎，女士们先生们，”她说。

source: The P.A. system was not of very high quality, and the bookstore really wasn't set up for that kind of thing, but I could make out every word of the store manager's introduction of Emily Barnes if I focused.
zh_cn: 扩音装置质量不是很高，书店实际上也不是为这类事情装备的，但如果我集中注意力，我能听清书店经理对艾米莉·巴恩斯的介绍的每一个字。

source: Colin squeezed my hand and raised his eyebrows at me.
zh_cn: 克林轻轻地捏了捏我的手，对我扬起了他的眉毛。

source: I gave him my sweetest smile and nodded.
zh_cn: 我给了他我最甜美的微笑，并点了点头。

source: Then Emily Barnes herself stepped onto the temporary stage.
zh_cn: 然后艾米莉·巴恩斯本人走上舞台。

source: Hands clapped in every row ahead of us, all the way up to the stage.
zh_cn: 我们前面的每一排都在鼓掌，一直到舞台。

source: Emily Barnes bowed a little, and smiled, then accepted the microphone from the manager's outstretched arm.
zh_cn: 艾米莉·巴恩斯微微鞠了一下躬，微笑，然后从经理伸出的手上接过麦克风。

source: "Hello." She said from behind me, from the speakers.
zh_cn: “嗨，”她从我身后，从扩音器里说。

source: After a pause she smiled apologetically and said, "I never really liked these things."
zh_cn: 停顿了一下，她抱歉地笑笑，说：“我其实从来都不喜欢这些东西。”

source: And then she put the microphone down on the floor of the stage.
zh_cn: 然后她把麦克风放在舞台的地板上。

source: She straightened up, and her lips started moving.
zh_cn: 她直起身，她的嘴唇开始动。

source: I didn't notice this at first, or if I did, my brain didn't process the first few seconds of it.
zh_cn: 我一开始没有注意到这个，或者虽然我注意到了，但我的大脑却没有处理最初的几秒钟。

source: I was caught by surprise.
zh_cn: 我措手不及。

source: A second later, when it occurred to me to start reading Emily Barnes' lips, I felt Colin's eyes on me.
zh_cn: 片刻之后，当我想到开始读艾米莉·巴恩斯的唇语时，我感到克林在注视着我。

source: I looked up and caught his eye, and he started to raise his arm.
zh_cn: 我抬头看到了他的眼睛，他开始举起手臂。

source: "No!"
zh_cn: “不要！”

source: I hissed and grabbed the arm.
zh_cn: 我嘘声说并抓住了那只手臂。

source: Colin gestured towards Emily Barnes angrily.
zh_cn: 克林愤怒地朝艾米莉·巴恩斯打手势。

source: Seeing his forehead in creases, his eyebrows in frowns, I suddenly had a very clear mental video of him at the Rammstein concert.
zh_cn: 看到他的额头皱起来，眉毛拧起来，我脑海中突然浮现出他在战车音乐会上的清晰影像。

source: How excited he was.
zh_cn: 他多兴奋啊。

source: His jumping up and down, his whoops, his huge grin, and his sweat glistening in the colored lights that traveled as if they were alive.
zh_cn: 他跳上跳下，他大喊大叫，他咧嘴大笑，他的汗水在仿佛有生命般游走的彩色灯光下闪闪发亮。

source: "No."
zh_cn: “不要。”

source: I told him.
zh_cn: 我对他说。

source: Sitting in my plastic chair with the video of his birthday running in my head, I suddenly had the most ferocious desire to be happy, to be excited, to jump up and down and whoop and grin.
zh_cn: 坐在我的塑料椅子上，脑子里播放着他生日时的录像，我突然间有极为强烈的愿望要快乐、要兴奋、要跳上跳下、要喊叫、要大笑。

source: I was determined to be happy, here and now, with my birthday present.
zh_cn: 我下定决心要对我的生日礼物感到快乐，就在此时此地。

source: "Why not?"
zh_cn: “为什么不？”

source: Colin asked.
zh_cn: 克林问。

source: "I can read the tone of expression from her lips," I told him.
zh_cn: “我可以从她的嘴唇读出声调语气，”我告诉他。

source: "What?"
zh_cn: “什么？”

source: "Shhh."
zh_cn: “嘘。”

source: I stood up, inched my way past knees and walked until I took up a spot near the stage where I could stand without occluding anyone's view.
zh_cn: 我站起来，慢慢地挪过一双双膝盖，然后走到舞台附近的一个地方停下来，我可以站在那里而不会挡住任何人的视线。

source: Colin remained in his plastic chair for a while, but he eventually came up from behind and slipped his arms around me.
zh_cn: 克林在他的塑料椅子上停了一会儿，但他最终从后面过来，悄悄地用手臂环住我。

source: I twisted around to smile up at him, a smile as bright as I felt inside.
zh_cn: 我转过身抬头向他微笑，如我内心所感觉到的那般欢快的微笑。

source: For the record, Emily Barnes' reading was exceptional.
zh_cn: 必须明确指出，艾米莉·巴恩斯的阅读是非常出色的。
